<template>
  <div class="afterword" ref="afterword">
    <h1>あとがき</h1>
    <perfect-scrollbar>
      <h2>0. はじめに</h2>
      <p>
        『めうちきりんのメトロポリス』を最後までプレイしていただき、ありがとうございました。<br>
        制作者のいっぺーです。
      </p>
      <p>
        このあとがきでは、このゲームを制作した背景といいますか、その思考についてお話しようと思います。<br>
      </p>
      <p>
        まずはじめに、私は<a href="https://myochikirin.ippee-music.com" target="_blank" rel="noopener">このゲームの公式サイト</a>で、以下のようなことを書きました。
      </p>
      <p>
        ==========<br><br>

        このノベルゲームにストーリーはありません。<br>
        また、詩のように独特のリズムを持つようなものでもありません。
      </p>
      <p>
        このゲームはいわば、<u>言葉遊び</u>の世界です。
      </p>
      <p>
        偶発的に鏤められた言葉の羅列と、飄々とした音楽に身を委ね、<br>
        綺麗な夜空が見える、ちょっぴり不思議な夜の街の雰囲気に浸っていたい……。
      </p>
      <p>
        そんなひと時をお届けするのが、めうちきりんのメトロポリスです。<br><br>

        ==========
      </p>
      <p>
        この世界観の意味するところについて、少し解説を加えておこうと思います。
      </p>
      <p>
        最後までプレイした方ならお分かりいただけると思いますが、<br>一般的なノベルゲームに比べ「変な」作品と感じたかもしれません。
      </p>
      <p>
        まず<u>どの物語もストーリーがなく</u>、これといった<u>登場人物も存在しません</u>。<br>
        また、<u>物語の一つひとつが非常に短く</u>、読んでみると<u>どれも突拍子の無い文章</u>ばかり……。<br>
        このノベルゲームは一体何がしたかったのでしょうか？
      </p>
      <p>
        実は、このゲームには<b>裏テーマ</b>が存在します。<br>
        それは、<br><br>
        <b>「カットアップという創作手法をベースに、自然言語処理の知見やショートショートといった作品形式を活用することによって、一般性の確保を図ったノベルゲームを制作すること」</b><br><br>
        です。
      </p><br>
      <h2>１．カットアップ</h2>
      <p>
        まず「カットアップ」とは何ぞや？　というお話です。
      </p>
      <p>
        カットアップとは、<u>既存の文章をハサミ等でばらばらに分解し、それらをランダムにつなぎ合わせて新しい文章を創り出すという創作手法</u>です。<br>
        時々即興で組み合わせた言葉を書き換えることもありますが、基本的には上記の通りで、かなり偶発性を重視する創作手法といえます。
      </p>
      <p>
        私がカットアップに注目した理由の１つに、「言語の不自由さからの開放」という点が挙げられます。
      </p><br>
      <h3>「言語の不自由さ」とは？</h3>
      <h4>a. 言語の限界</h4>
      <p>
        まず本質的に、言語には限界が存在します。<br>
        それは、<u>人間が認知したもの、あるいは思考したもの以外を言語化することはできず、またその精度も低い</u>という点です。
      </p>
      <p>
        まず認知について。<br>
        突然ですが、「紫外線」は何色だと思いますか？　「紫」が付いているから紫色？<br>
        答えは、「存在しない」です。<br>
        紫外線は人の目では見ることができない光の一種であり、人間はその色を感じることはできません。<br>
        他の動物であれば紫外線を目で認知できるものもおりますので、その動物にとっては何らかの色が見えるのかもしれませんが、それを人間が知ることはできません。<br>
        仮に紫外線に色名を付けたとしても、それは色としての本質を失ったいわば「ナンセンスな色」と言わざるを得ません。<br>
        このように人間が認知できないものを言語化した場合、それは人間にとって何の意味も成さないものとなってしまうのです。
      </p>
      <p>
        思考についても同じです。<br>
        オーストリアの哲学者 ルートヴィヒ・ウィトゲンシュタインは、著書『論理哲学論考』において、「思考の限界とは、言語の限界である」ということを本の中で指摘しています。<br>
        当たり前ですが、人間は思考不可能なことを思考することはできません。<br>
        思考が言語によって行われている以上、思考以上の言語を生み出すこともまた不可能なのです。
      </p>
      <p>
        このように、認知・思考できないものを言語にしようとすると、その先にはただナンセンスしか存在しないのです。
      </p>
      <p>
        それだけではありません。<br>
        言語化されたそれというのはまた、非常に精度が低いことが往々にしてあるのです。
      </p>
      <p>
        その代表格が「感情」です。<br>
        我々は「嬉しい」や「楽しい」といった感情を表す言葉を普段から使用しますが、これというのは酷く曖昧で不確定なものです。<br>
        というのも、確かに「嬉しい」や「楽しい」といった言葉が存在しているのですから、そこには人間にとって何らかの共通があるのかもしれません。<br>
        しかし、それを言葉によって共有する手段を我々は持ち合わせていません。<br>
        例えば、「嬉しい」という言葉一つ取ったとして、それが<b>「どのように」</b>嬉しいのかを問われた時、それを表現するのは並大抵のことではありません。<br>
      </p>
      <p>
        日本近代文学の父と称される詩人 萩原朔太郎は、そうした複雑な感情をリズムによって表現し、それを無言で感知できる人とのみ共有できると、著書『月に吠える』の中で述べています。<br>
        しかし、その感情が共有されていることを判断するのは主観であり、客観的に証明することはできません。<br>
        仮にそれが証明されたとしても、言葉による感情の共有というのは日本を代表する詩人が以てしても限定的にしかならないのです。<br>
        もちろん、文学の感情を主題とする分野に対して理性をぶつけるのは不毛であると重々承知しておりますが、とにかくここでは、感情を表す言葉の精度は恐ろしく低く、それを言葉で表現することは至難であるということが伝われば、この解説の目的は達されます。
      </p><br>
      <h4>b. 言語の偏り・言語へのバイアス</h4>
      <p>
        先の章でウィトゲンシュタインが登場しましたが、彼が「思考の限界＝言語の限界」という結論に至る流れの一部を簡単に説明すると、ウィトゲンシュタインはその論証の中で、言葉同士を組み合わせが意味として成立するかを真理値（真：Ture、偽：False）によって判定を行います。<br>
        それらのうち真と評価されたものは思考可能、それ以外はナンセンス（思考不可能）とすることで、「思考の限界」に迫ろうとしたのです。<br>
        <span style="font-size: 2rem;">（詳しくは論理哲学論考をお読みください。矢野茂樹さんが翻訳されているものが比較的読みやすいかと思います）</span>
      </p>
      <p>
        ここで留意すべき点として、この評価は非常に極端なものであるということです。<br>
        論理哲学論考における基本的な関心は「人間はどこまで物事を考えられるか」です。<br>
        この問いは具体的な思考内容を問うものではなく、いわば「イエスかノーか」の可能性を問う問題であるため、その言葉の組み合わせが意味として成立するか否かを知れるだけで達成されます。<br>
        つまり、そうした大雑把な評価でも問題なかったということです。<br>
      </p>
      <p>
        しかしその一方、確実に言えることとして、<u>言葉同士の結びつきには明らかな偏りが存在します</u>。
      </p>
      <p>
        例えば、「月」という言葉を考えてみましょう。<br>
        日本語において「月」という言葉が出てくる文脈というのは、「夜」という言葉とセットであることが非常に多いです（例：今日の夜は月が見える）。<br>
        逆に、「月」という言葉と、今私がこの文章を書きながら片手間で食べている「ベ〇ー〇ターラー〇ン」との結びつきというのは、残念ながら「夜」という言葉と比べるとかなり低いと言わざるを得ません（例：月にベ〇ー〇ターラー〇ンを落とす）。
      </p>
      <p>
        もっと一般的な例を挙げるとするならば、ある言葉と組み合わされて使用される確率が高い言葉を示す「共起語・連語・連想語」なんかはまさにそれです。<br>
        こうした言葉が存在することからも、言葉同士の結びつきには偏りがあることが見て取れます。
      </p>
      <p>
        この偏りがあることによって、本来であれば有意味となる言葉の組み合わせがあったとしても、組み合わせられる確率が低いために選択されないどころか、その可能性に気づくこともできないという事態を引き起こします。
      </p>
      <p>
        言語というのは本来、より表現豊かなものであるはずなのに、人間側がこうしたバイアスを無意識のうちに掛けてしまうため、私を含めたほどんどの人間にはそのポテンシャルを存分に発揮させることができません。<br>
        いやむしろ、<u>有限である言語の表現力が、人間側のバイアスによってさらに制限されてしまう</u>、と言った方が適切かもしれません。
      </p>
      <p>
        どちらにせよ、これはもったいないことであり、また言語に対して申し訳なくもあるのです。
      </p><br>
      <h4>「言語の不自由さ」を超える</h4>
      <p>
        では、どうすればこの限界や偏り、もとい「言語の不自由さ」を乗り越えることができるのでしょうか？<br>
      </p>
      <p>
        その答えが、<b><u>「カットアップ」</u></b>です。
      </p>
      <p>
        カットアップでは、切り取った言葉を無作為に並び替えます。<br>
        そこに人間側の思考やバイアスが入り込む余地はなく、機械的なプロセスによって文章は生成されます。<br>
        かくして言語に対するバイアスは消滅し、より自由度の高い言葉の表現が可能になる、というわけです。
      </p>
      <p><br></p>
      <p>
        が、しかし。<br>
        それですべては解決しないのです。
      </p><br>
      <h3>ウィリアム・バロウズ</h3>
      <p>
        このように考えた作家は世の中に数多く存在します。<br>
        アメリカの作家 ウィリアム・バロウズもその一人です。
      </p>
      <p>
        バロウズが私と同じように考えたかは定かではありませんが、バロウズの著書『裸のランチ』において、先ほどの『論理哲学論考』からの引用が存在することから、少なくともバロウズはカットアップとウィトゲンシュタインの二つに関連を見出していたと考えます。
      </p>
      <p>
        では、果たしてバロウズのその結果はどうだったのか。<br>
        その答えの一つとして、『裸のランチ』からとある会話文を引用したいと思います。
      </p>
      <p>
        ==========<br><br>
        「立てよ、ガーディ、土地の連中に敬意を示すんだ」<br>
        「そうすべきでしょうね」<br>
        「ねえきみ、ぼくは実に驚くべき発明に従事しているよ……<u>いく</u>と、とたんに消えてしまう少年なんだ、木の葉が燃えているにおいと、遠い汽車の汽笛の音を残してね」<br>
        <br>
        W・バロウズ: 裸のランチ, 河出文庫, 鮎川信夫 (訳), 2003, 13刷, p.158<br><br>
        ==========<br>
        <span style="font-size: 2rem">（会話はまだ続くのですが、少々センシティブな内容を含む＆長くなるため、ここでの引用は避けさせていただきます）</span>
      </p>
      <p>
        若干文脈として不自然な返答もあれば、明らかに会話が成り立っていない所もあるかと思います。<br>
        意図的にそうした箇所を引用したという側面もありますが、この小説は全体的にこうした脈絡のない展開を非常に多く含みます。
      </p>
      <p>
        このようにカットアップでは、作者が意図的に文章を修正していたとしても、前後の文脈が繋がらなかったり、あるいは言語としてナンセンスな文章を大量に生み出してしまうといったことが頻発します。<br>
      </p>
      <p>
        バロウズのそれはそれで、一つの作品として非常に魅力的なものであると私は感じるのですが、ただこれが一般にウケなかったことは言うまでもありません（バロウズは有名な作家ですが、その言葉の表現が評価されたアーティストというわけではありません）。
      </p>
      <p><br></p>
      <p>
        <u>言語の自由さを追求すると、途端に一般性を失っていく。</u><br>
        では、このジレンマをどう克服すればよいのでしょうか？
      </p>
      <p>
        方法はたくさんあるかと思いますが、私は<b>「自然言語処理」</b>と<b>「ショートショート」</b>という二つの視点からその可能性を模索してみました。
      </p><br>
      <h2>２．自然言語処理</h2>
      <p>
        自然言語処理とは、我々が日常的に使っている言語をコンピュータによって処理する技術のことです。<br>
        分かりやすいものであれば、会話AIや翻訳機能、音声認識、自動要約など、言語 x 情報技術の様々なアプローチが日々研究されています。
      </p>
      <p>
        このゲームで主に使われている自然言語処理の技術として、「形態素解析」と「文章生成」の二つが挙げられます。<br>
        形態素解析は文章を形態素（意味を持つの最小単位の要素）に分割する技術のことで、これをカットアップの手がかりとして利用しています。<br>
        また文章生成では、形態素解析の結果を元に、確率的に言葉同士を繋ぎ合わせる<u>N階マルコフ連鎖</u>という手法を用いて文章を生成しています。
      </p>
      <p>
        他にも、<a href="https://www.12kai.com/cutup/cumaking01.html" target="_blank" rel="noopener">細馬宏通教授による「カットアッププログラム」</a>を参考にしたオリジナルのカットアッププログラムといったものも使用しています（こちらについてはいずれアプリとして公開する予定です）。<br>
      </p>
      <p>
        このように、自然言語処理の技術をカットアップに応用することによって、無秩序な文章の破壊ではなく、「多少の」文法・文脈を考慮した上での文章の切り取り、および文章生成ができるようになります。
      </p><br>
      <h3>ストーリー・シナリオの構築</h3>
      <p>
        しかし、構文解析と文章生成の二つを持ってしても、まだ解決できない問題があります。<br>
        それは<u>ストーリーやシナリオ</u>です。<br>
        いくら文章を生成できたとしても、それらは元ある文章の言葉をランダムに組み替えただけですので、そこから一定の流れを持つストーリーやシナリオを構築することはほぼ不可能です。
      </p>
      <p>
        しかし、逆にこうも考えることはできないでしょうか？
      </p>
      <p>
        <b>「最初からシナリオなんていらない」</b>
      </p>
      <p>
        文学の世界というのは、大きな流れを持つ物語だけで成り立っているわけではないのです。
      </p><br>
      <h2>３．ショートショート</h2>
      <p>
        ここで二つ目の視点、<b>「ショートショート」</b>です。
      </p>
      <p>
        ショートショートを一言で述べるとするならば、「短く、ユーモアに富んだ小説」といった感じでしょうか。<br>
        どれくらい短いのかを知るために、ここでは稲垣足穂の『一千一秒物語』の世界を覗いてみましょう。
      </p>
      <p>
        ==========<br><br>
        ある夜倉庫のかげで聞いた話<br><br>

        「お月様が出ているね」<br>
        「あいつはブリキ製です」<br>
        「なに、ブリキ製だって？」<br>
        「ええどうせ旦那、ニッケルメッキですよ」（自分が聞いたのはこれだけ）<br><br>

        稲垣足穂: 一千一秒物語, 新潮文庫, 1923, 13刷, p.12<br><br>
        ==========<br>
        <span style="font-size: 2rem;">（もちろん作品によってショートショートの長さはまちまちですが、このように短く、しかし全く予想のつかない意外な結末を持つ作品を見ると、私はショートショートらしさを感じます）</span>
      </p>
      <p>
        このようにショートショートにおいて、シナリオが必ずしも重要項目にはなりません。<br>
        短いからこそインパクトのあるユーモアが、ショートショート最大の特徴です。
      </p><br>
      <h3>カットアップ・自然言語処理・ショートショート</h3>
      <p>
        先ほど紹介したカットアップと、このショートショートと呼ばれる作品形式。<br>
        片や摩訶不思議な言葉の羅列を作れるが、大きな流れを持つ文章は作れない。<br>
        片やユーモラスが重視される非常に短い物語。
      </p>
      <p>
        <b>実はこの二つ、相性が抜群に良いのです。</b><br>
      </p>
      <p>
        最初からストーリーやシナリオを捨て、短くユーモアに特化したショートショート形式の物語を、自然減処理を活用したカットアップで作れば、摩訶不思議な言葉の羅列と、一般性を両立した面白い作品が作れるのではないだろうか……？
      </p>
      <p>
        その試みこそが、この『めうちきりんのメトロポリス』であり、このゲームが「言葉遊び」である所以です。
      </p><br>
      <h2>4. おわりに</h2>
      <p>
        「あとがきが本編」と言わんばかりの長ったらしい文章を最後まで読んでくださり、本当にありがとうございます……汗<br>
      </p>
      <p>
        この作品は、制作当初からここまで考えられて制作したものではありません。<br>
        むしろスタート時点では、「あ゛ぁ゛＾～～～おれもノベルゲーム作りたいんじゃ＾～～～」とか言うクッソ軽いノリで作り始めています。<br>
        もっとぶっちゃけると、裏テーマとか、カットアップの言語の不自由からの開放とか、ハッキリ言って超どうでもいいですし興味もなかったです（おい）<br>
        が、パロウズやカットアップ、あるいはコラージュの歴史なんかを調べて考えていくうちに……といった感じです。<br>
      </p>
      <p>
        中身がありそうで何もないノベルゲームではありますが、この作品の空気感というのは我ながらかなり好みのものに仕上げることができました。<br>
        案外ゲーム作りも楽しかったので、もしかしたらまた別な形でノベルゲームを作るかも？　しれませんね。<br>
        その時はもう少し意図を持ち、説明ではない「リズム」で表現したいものです……笑
      </p>
      <p>
        最後に宣伝という形になってしまうのですが、私は音楽制作やプログラミングで色々なものを作ることが本職です。<br>
        <a href="https://portfolio.ippee-music.com/" target="_blank" rel="noopener">ポートフォリオ</a>では過去の作品、ブログ<a href="https://ippee-music.com/" target="_blank" rel="noopener">『オルタナハアト』</a>では音楽制作やプログラミングの技術寄りの内容を発信しています。
      </p>
      <p>
        また、このゲームのソースコードをGitHubで公開しておりますので、こちらも興味のある方はぜひご覧ください。<br>
        - <a href="https://github.com/ippee/novel_game" target="_blank" rel="noopener">ippee /novel_game</a>
      </p>
      <p><br></p>
      <p>
        というわけで、『めうちきりんのメトロポリス』をこれにて〆たいと思います。<br>
        最後までお付き合いいただきありがとうございました。
      </p>
      <p>
        それではみなさん、良い夢を……。
      </p>
    </perfect-scrollbar>
  </div>
</template>

<script>
export default {
  name: 'afterword',
  mounted: function() {
    this.$refs.afterword.classList.add('fadein')
  },
}
</script>

<style>
.afterword .ps {
  width: 60vw;
  height: 60vh;
}

.afterword * {
  user-select: text!important;
  -webkit-user-select: text !important;
  -ms-user-select: initial !important;
  cursor: auto !important;
  pointer-events: all !important;
}

.afterword p {
  text-align: left;
  font-size: 2.4rem;
  margin: 3rem 3rem;
}

.afterword a {
  font-size: 2.4rem;
  border-bottom: 1px dashed #fbfaf5;
}

.afterword h3, .afterword h4 {
  font-size: 2.4rem;
  padding-top: 1rem;
}
</style>