<template>
  <div class="afterword" id="afterword">
    <h1>あとがき</h1>
    <perfect-scrollbar>
      <h2>0. はじめに</h2>
      <p>
        『めうちきりんのメトロポリス』を最後までプレイしていただき、ありがとうございました。<br>
        制作者のいっぺーです。
      </p>
      <p>
        このあとがきでは、このゲームを制作した背景や、制作にまつわる裏話等をお話しようと思います。<br>
        ……と言っても、無計画にこれを書き始めているので、内容は取っちらかっているかもしれません。
      </p>
      <p>
        最後までプレイした方ならお分かりいただけると思いますが、<br>
        このゲームはノベルゲームという括りで見れば、かなり異質なことをやっている作品だと思います。
      </p>
      <p>
        まず<u>ストーリーがありません</u>。またこれといった<u>登場人物もいません</u>。<br>
        何より<u>物語の一つひとつが非常に短い</u>です。<br>
        そして蓋を開けてみてみると、<u>どれも突拍子の無い文章</u>ばかり……。<br>
        さて、一体このノベルゲームは何がしたかったのでしょうか？
      </p>
      <p>
        実は、このゲームには<b>裏テーマ</b>が存在します。<br>
        それは、<br><br>
        <b>「カットアップという創作手法をベースに、自然言語処理の知見やショートショートといった作品形式を活用することによって、一般性の確保を図ったノベルゲームを制作すること」</b><br><br>
        です。<br>
        長ったらしいので１つずつ見ていきましょう。
      </p><br>
      <h2>1. カットアップ</h2>
      <p>
        まず「カットアップ」とは何ぞや？　というお話です。
      </p>
      <p>
        カットアップとは、<u>既存の文章をハサミ等でばらばらに分解し、それらをランダムにつなぎ合わせて新しい文章を創り出すという創作手法</u>です。<br>
        時々、即興で組み合わせた言葉を書き換えることもありますが、基本的には上記の通りで、かなり偶発性を重視した創作手法であることに変わりありません。
      </p>
      <p>
        私がカットアップに注目した理由の１つに、「言語の不自由さからの開放」という点が挙げられます。
      </p><br>
      <h3>ウィトゲンシュタインとカットアップ</h3>
      <p>
        普段、我々は物事を考えるとき、言語を使用します。<br>
        オーストリアの哲学者 ルートヴィヒ・ウィトゲンシュタインは、著書『論理哲学論考』において、「思考の限界とは、言語の限界である」ということを本の中で指摘しています。
      </p>
      <p>
        ウィトゲンシュタインはその論証の中で、言葉同士を組み合わせが意味として成立するかを真理値（真：Ture、偽：False）によって判定するという操作を行っています（しばしばウィトゲンシュタインは、言葉の限界を越えた先を「ナンセンス」と呼びます）。<br>
        論理において偶然というものは存在しないため、ありとあらゆる言葉の組み合わせがすべて同等のものとして扱われます。
      </p>
      <p>
        論理哲学論考における基本的な関心は、「人間はどこまで物事を考えられるか」であるため、個々の言葉の組み合わせに関する具体的な可能性の値について検討する必要はありません。<br>
        ただ文章の意味が成立するか否かを知れればよいからです。
      </p>
      <p>
        しかし確実に言えることとして、<u>言葉同士の結びつきには明らかな偏りが存在します</u>。
      </p>
      <p>
        例えば、「月」という言葉を考えてみましょう。<br>
        日本語において「月」という言葉が出てくる文脈というのは、「夜」という言葉とセットであることが非常に多いです（例：今日の夜は月が見える）。<br>
        逆に、「月」という言葉と、今私がこの文章を書きながら片手間で食べている「ベ〇ー〇ターラー〇ン」との結びつきというのは、残念ながら「夜」という言葉と比べるとかなり低いと言わざるを得ません（例：月にベ〇ー〇ターラー〇ンを落とす）。
      </p>
      <p>
        もっと一般的な例を挙げるとするならば、ある言葉と組み合わされて使用される確率が高い言葉を示す「共起語・連語」なんかはまさにそれです。<br>
        こういった言葉が存在することからも、言葉同士の結びつきには偏りがあることがお分かりになるかと思います。
      </p>
      <p>
        この偏りを意識的に把握したり、あるいは破壊するといったことは、通常困難です。<br>
        ですが、これを効果的に破壊する方法を、我々は既に知っています。
      </p>
      <p>
        そう。<br>
        ここで出てくるのが、<b><u>「カットアップ」</u></b>です。
      </p>
      <p>
        カットアップにおける言語の不自由さからの開放とはつまり、上記で示した通り、<u>言葉同士の強い結びつきの破壊</u>です。<br>
        この手法を使って文章を作れば、より自由な言葉の世界が広がっているのではないだろうか……？
      </p><br>
      <h3>ウィリアム・バロウズ</h3>
      <p>
        と、考えた作家が世の中には数多く存在します。<br>
        アメリカの作家 ウィリアム・バロウズもその一人です。
      </p>
      <p>
        バロウズが私と同じように考えたかは定かではありませんが、バロウズの著書『裸のランチ』において、先ほどの『論理哲学論考』からの引用が存在することから、少なくともバロウズはカットアップとウィトゲンシュタインの二つに関連があったことを見抜いていたと考えます。
      </p>
      <p>
        では、果たしてバロウズのその結果はどうだったのでしょうか？<br>
        その答えの一つとして、『裸のランチ』からとある会話文を引用したいと思います。
      </p>
      <p>
        ==========<br>
        「立てよ、ガーディ、土地の連中に敬意を示すんだ」<br>
        「そうすべきでしょうね」<br>
        「ねえきみ、ぼくは実に驚くべき発明に従事しているよ……<u>いく</u>と、とたんに消えてしまう少年なんだ、木の葉が燃えているにおいと、遠い汽車の汽笛の音を残してね」<br>
        <br>
        W・バロウズ: 裸のランチ, 河出文庫, 鮎川信夫 (訳), 2003, 13刷, p.158<br>
        ==========<br>
        <span style="font-size: 2rem">（会話はまだ続くのですが、少々センシティブな内容を含む＆長くなるため、ここでの引用は避けさせていただきます）</span>
      </p>
      <p>
        いかがでしょうか？<br>
        若干文脈として不自然な返答もあれば、明らかに会話が成り立っていない所もあるかと思います。<br>
        意図的にそうした箇所を引用したという側面もありますが、この小説は全体的にこうした脈絡のない展開を非常に多く含みます。
      </p>
      <p>
        このようにカットアップでは、作者が意図的に文章を修正していたとしても、前後の文脈が繋がらなかったり、あるいは言語としてナンセンスな文章を大量に生み出してしまうといったことが頻発します。<br>
      </p>
      <p>
        バロウズのそれはそれで、一つの作品として非常に魅力的なものであると私は感じるのですが、ただこれが一般にウケなかったことは言うまでもありません（ちなみに、この本自体がエロ・グロな表現を多く扱うため、当時のアメリカではこれが発売禁止となりました）。
      </p>
      <p>
        <u>言語の自由さを追求すると、途端に一般性を失っていく。</u><br>
        では、このジレンマをどう克服すればよいのでしょうか？
      </p>
      <p>
        方法はたくさんあるかと思いますが、私は<b>「自然言語処理」</b>と<b>「ショートショート」</b>という二つの視点からその可能性を模索してみました。
      </p><br>
      <h2>2. 自然言語処理</h2>
      <p>
        自然言語処理とは、我々が日常的に使っている言語をコンピュータによって処理する技術のことです。<br>
        分かりやすいものであれば、会話AIや翻訳機能、音声認識、文章自動要約などなどなどなど……。<br>
        扱っているものが言語とコンピュータという組み合わせのため、とにかく幅が広いです。
      </p>
      <p>
        このゲームで主に使われている自然言語処理の技術として、「形態素解析」と「文章生成」の二つが挙げられます。<br>
        形態素解析は文章を品詞に分解する技術（正確には違う）のことで、これをカットアップの手がかりとして利用しています。<br>
        また文章生成では、形態素解析の結果を元に、確率的に言葉同士を繋ぎ合わせる<u>N階層マルコフ連鎖</u>という手法を用いて文章を生成しています（詳しい解説は省略）。
      </p>
      <p>
        他にも、<a href="https://www.12kai.com/cutup/cumaking01.html" target="_blank" rel="noopener">細馬宏通教授による「カットアッププログラム」</a>を参考にしたオリジナルのカットアッププログラムといったものも使用しています（こちらについてはいずれアプリとして公開する予定です）。<br>
      </p>
      <p>
        このように、自然言語処理の技術をカットアップに応用することによって、無秩序な文章の破壊ではなく、「多少の」文法・文脈を考慮した上での文章の切り取り、および文章生成ができるようになります。
      </p>
      <p>
        通常のカットアップと比べると自由度に制限がかかってしまいますが、完全に文法の崩壊した文章が生成されにくいため、誤解を恐れずに言うならば、有意味とナンセンスのギリギリを攻めるような文章を作ることに長けています（もちろん、設定次第では滅茶苦茶な文章も生成できます）。
      </p><br>
      <h3>ストーリー・シナリオの構築</h3>
      <p>
        しかし、構文解析と文章生成の二つを持ってしても、まだ解決できない問題があります。<br>
        それは<u>ストーリーやシナリオ</u>です。<br>
        いくら文章を生成できたとしても、それらは元ある文章の言葉をランダムに組み替えただけですので、そこから一定の流れを持つストーリーやシナリオを構築することはほぼ不可能です。
      </p>
      <p>
        しかし、逆にこうも考えることはできないでしょうか？
      </p>
      <p>
        <b>「最初からシナリオなんていらない」</b>
      </p>
      <p>
        完全にいらない、というわけではありませんが、少なくとも大きな流れを持つ物語だけで文学の世界が成り立っているわけではありません。
      </p><br>
      <h2>3. ショートショート</h2>
      <p>
        ここで二つ目の視点、<b>「ショートショート」</b>です。
      </p>
      <p>
        ショートショートを一言で述べるとするならば、「短く、ユーモアに富んだ小説」といった感じでしょうか。<br>
        どれくらい短いのかというと、これくらい短いです。
      </p>
      <p>
        ==========<br>
        ある夜倉庫のかげで聞いた話<br><br>

        「お月様が出ているね」<br>
        「あいつはブリキ製です」<br>
        「なに、ブリキ製だって？」<br>
        「ええどうせ旦那、ニッケルメッキですよ」（自分が聞いたのはこれだけ）<br><br>

        稲垣足穂: 一千一秒物語, 新潮文庫, 1923, 13刷, p.12<br>
        ==========<br>
        <span style="font-size: 2rem;">（もちろん作家によってショートショートの長さはまちまちですが、このように短く、しかし全く予想のつかない意外な結末を持つ作品を見ると、私はショートショートらしさを感じます）</span>
      </p>
      <p>
        このようにショートショートにおいて、シナリオが必ずしも重要項目にはなりません。<br>
        短いからこそインパクトのあるユーモアが、ショートショート最大の特徴です。
      </p><br>
      <h3>カットアップ・自然言語処理・ショートショート</h3>
      <p>
        このショートショートですが、カットアップと非常に相性が良いと思いませんか？<br><br>
        片や摩訶不思議な言葉の羅列を作れるが、大きな流れを持つ文章は作れない。<br>
        片やユーモラスが重視される非常に短い物語。
      </p>
      <p>
        そう、<b>実はこの二つは相性が抜群に良いのです。</b><br>
      </p>
      <p>
        最初からストーリーやシナリオを捨て、短くユーモアに特化したショートショート形式の物語を、自然減処理を活用したカットアップで作れば、摩訶不思議な言葉の羅列と、一般性を両立した面白い作品が作れるのではないだろうか……？
      </p>
      <p>
        ここで始めの言葉に戻ってみましょう。
      </p>
      <p>
        このゲームの裏テーマとは、<b>「カットアップという創作手法をベースに、自然言語処理の知見やショートショートといった作品形式を活用することによって一般性の確保を図ったノベルゲームを制作すること」</b>です。
      </p>
      <p>
        こうした背景の中、私は『めうちきりんのメトロポリス』という作品を制作しました。
      </p><br>
      <h2>4. 作品紹介</h2>
      <p>
        制作裏話なんかもお話しようかと思ったのですが、さすがに長すぎるのでいずれどこかの機会があればお話することとしましょう。
      </p>
      <p>
        最後に、このゲームを作る上で特に参考にした作品についてご紹介させていただきます。<br>
      </p><br>
      <h3>ウィトゲンシュタイン『論理哲学論考』</h3>
      <p>
        先ほどの解説（？）でも登場しましたが、あの解説は重要な過程の説明をすっ飛ばしていたり、あまり適切でない表現を使用していたりと、ちゃんと哲学を通った人からすればぶん殴られても仕方がないレベルの内容でした（すまぬ……）。<br>
        というのも、その辺りをちゃんと説明するだけで本一冊を簡単に書けてしまうレベルの内容だったので、ここではあまり深入りできなかったんですね。
      </p>
      <p>
        論考はこのゲーム制作に関係なく、私の人生に大きな影響を与えた一冊でもあります。<br>
        そして私だけでなく、他の人も、また学問分野にも多大な影響を与えたことで有名です。<br>
        一言で言うなれば、<b>世界の見え方が変わる本</b>、とだけ言っておきましょう。<br>
        非常にオススメです。
      </p><br>
      <h3>ウィリアム・バロウズ『裸のランチ』</h3>
      <p>
        裸のランチは、私がカットアップという手法を知ることとなった最初の作品です。<br>
        この本と出会っていなければ、このゲームは間違いなく完成しなかったでしょう。
      </p>
      <p>
        本の内容としては、あまり人に強く勧められるものではありませんが、薬物やら同性愛に関連した表現を多く含むため、その辺りに興味があれば、何か感じるものがあるかもしれません。
      </p><br>
      <h3>稲垣足穂『一千一秒物語』</h3>
      <p>
        一千一秒物語は、日本におけるショートショートの草分け的存在の小説です。<br>
        日本では星新一がショートショートの名手として有名ですが、彼に影響を与えた人物の一人が稲垣足穂であり、この一千一秒物語であったりもします。
      </p>
      <p>
        私はこの小説が本当に大好きで、このゲームの雰囲気もかなり一千一秒物語の雰囲気を意識して制作しています。<br>
        ゲームの方ではややじめっとした表現やニヒリズムチックな要素を含んでいたのに対し、一千一秒物語はもっと過激で、まるでオモチャの世界のような表現を多く含んでいます。<br>
        このゲームの雰囲気が好みであれば、間違いなく一千一秒物語はオススメできます。
      </p><br>
      <h3>ステージ☆なな『narcissu』</h3>
      <p>
        読み方「ナルキッソス」<br>
        フリーゲームや同人ゲーム界隈で非常に有名なノベルゲームです。
      </p>
      <p>
        ナルキッソスのシナリオ担当の一人である片岡ともは、「（ノベル型の）ゲームを追求していけば音楽とテキストだけで十分ではないか」という考えを持つ人でした。<br>
        そのためこのゲームには立ち絵がなく、基本的に背景とテキストと音楽のみで進行するという、ノベルゲームとしてはかなり攻めた作品となっています。<br>
      </p>
      <p>
        この考え方と私が今回作ったノベルゲームとの間にはどこか通じるものがあると感じたので、ゲームUIやデザインといった側面で、このナルキッソスを参考にさせていただきました。
      </p>
      <p>
        ナルキッソスはゲームのUIに限らず、ストーリーも大変すばらしいものです（語彙力の低下）。<br>
        自殺をテーマにしているためやや重い内容ではあるのですが、自殺者数が多いこの日本において、ナルキッソスは何か我々に示してくれるものがあるのではないでしょうか。
      </p><br>
      <h2>5. おわりに</h2>
      <p>
        こんなにも長ったらしい文章を最後まで読んでくださり、本当にありがとうございます……汗<br>
        なぜか本編よりもあとがきの方が圧倒的に長くなってしまいましたね、ﾅﾝﾃﾞｶﾅ。<br>
        むしろこっちが本編なんじゃn……いえ、やめておきましょう。
      </p>
      <p>
        最後に宣伝という形になってしまいますが、私は音楽制作とプログラミングで色々なものを制作することが本職です。<br>
        <a href="https://portfolio.ippee-music.com/" target="_blank" rel="noopener">ポートフォリオ</a>では過去の作品、<a href="https://ippee-music.com/" target="_blank" rel="noopener">ブログ『オルタナハアト』</a>では技術寄りの内容を公開しておりますので、ぜひこちらもご覧ください。
      </p>
      <p>
        というわけで、『めうちきりんのメトロポリス』もこれにて〆たいと思います。<br>
        最後までお付き合いいただきありがとうございました。
      </p>
      <p>
        それではみなさん、良い夢を……。
      </p>
    </perfect-scrollbar>
  </div>
</template>

<script>
export default {
  name: 'afterword',
  mounted: function() {
    document.getElementById('afterword').classList.add('fadein')
  },
}
</script>

<style>
.afterword .ps {
  width: 60vw;
  height: 60vh;
}

.afterword * {
  user-select: text!important;
  -webkit-user-select: text !important;
  -ms-user-select: initial !important;
  cursor: auto !important;
  pointer-events: all !important;
}

.afterword p {
  text-align: left;
  font-size: 2.4rem;
  margin: 3rem 3rem;
}

.afterword a {
  font-size: 2.4rem;
  border-bottom: 1px dashed #fbfaf5;
}

.afterword h3 {
  font-size: 2.4rem;
  padding-top: 1rem;
}
</style>