<template>
  <div class="afterword" id="afterword">
    <h1>あとがき</h1>
    <perfect-scrollbar>
      <h2>0. はじめに</h2>
      <p>
        『めうちきりんのメトロポリス』を最後までプレイしていただき、ありがとうございました。<br>
        制作者のいっぺーです。
      </p>
      <p>
        このあとがきでは、このゲームを制作した背景といいますか、その思考についてお話しようと思います。<br>
      </p>
      <p>
        まずはじめに、私は<a href="https://myochikirin.ippee-music.com" target="_blank" rel="noopener">このゲームの公式サイト</a>で、以下のようなことを書きました。
      </p>
      <p>
        ==========<br><br>

        このノベルゲームにストーリーはありません。<br>
        また、詩のように独特のリズムを持つようなものでもありません。
      </p>
      <p>
        このゲームはいわば、<u>言葉遊び</u>の世界です。
      </p>
      <p>
        偶発的に鏤められた言葉の羅列と、飄々とした音楽に身を委ね、<br>
        綺麗な夜空が見える、ちょっぴり不思議な夜の街の雰囲気に浸っていたい……。
      </p>
      <p>
        そんなひと時をお届けするのが、めうちきりんのメトロポリスです。<br><br>

        ==========
      </p>
      <p>
        この世界観について、少し解説を加えておこうと思います。
      </p>
      <p>
        最後までプレイした方ならお分かりいただけると思いますが、<br>
        このゲームはノベルゲームという括りで見れば、かなり異質なことをやっている作品だと思います。
      </p>
      <p>
        まず<u>ストーリーがありません</u>。またこれといった<u>登場人物もいません</u>。<br>
        何より<u>物語の一つひとつが非常に短い</u>です。<br>
        そして蓋を開けてみてみると、<u>どれも突拍子の無い文章</u>ばかり……。<br>
        さて、一体このノベルゲームは何がしたかったのでしょうか？
      </p>
      <p>
        実は、このゲームには<b>裏テーマ</b>が存在します。<br>
        それは、<br><br>
        <b>「カットアップという創作手法をベースに、自然言語処理の知見やショートショートといった作品形式を活用することによって、一般性の確保を図ったノベルゲームを制作すること」</b><br><br>
        です。
      </p><br>
      <h2>1. カットアップ</h2>
      <p>
        まず「カットアップ」とは何ぞや？　というお話です。
      </p>
      <p>
        カットアップとは、<u>既存の文章をハサミ等でばらばらに分解し、それらをランダムにつなぎ合わせて新しい文章を創り出すという創作手法</u>です。<br>
        時々、即興で組み合わせた言葉を書き換えることもありますが、基本的には上記の通りで、かなり偶発性を重視した創作手法であることに変わりありません。
      </p>
      <p>
        私がカットアップに注目した理由の１つに、「言語の不自由さからの開放」という点が挙げられます。
      </p><br>
      <h3>「言語の不自由さ」とは？</h3>
      <p>
        普段、我々は物事を考えるとき、言語を使用します。<br>
        オーストリアの哲学者 ルートヴィヒ・ウィトゲンシュタインは、著書『論理哲学論考』において、「思考の限界とは、言語の限界である」ということを本の中で指摘しています。
      </p>
      <p>
        ウィトゲンシュタインはその論証の中で、言葉同士を組み合わせが意味として成立するかを真理値（真：Ture、偽：False）によって判定するという操作を行っています。<br>
        論理において偶然というものは存在しないため、ありとあらゆる言葉の組み合わせがすべて同等のものとして扱われます。
      </p>
      <p>
        この操作によって真と判定されれば有意味、偽と判定されればナンセンス、というわけなのですが、単にそれだけで本当に良いのでしょうか？<br>
      </p>
      <p>
        論理哲学論考における基本的な関心は、「人間はどこまで物事を考えられるか」であるため、個々の言葉の組み合わせに関する具体的な可能性の値について検討する必要は確かにありません。<br>
        ただ文章の意味が成立するか否かを知れるだけで、その目的は達成されるからです。
      </p>
      <p>
        ただ、その一方で確実に言えることとして、<u>言葉同士の結びつきには明らかな偏りが存在します</u>。
      </p>
      <p>
        例えば、「月」という言葉を考えてみましょう。<br>
        日本語において「月」という言葉が出てくる文脈というのは、「夜」という言葉とセットであることが非常に多いです（例：今日の夜は月が見える）。<br>
        逆に、「月」という言葉と、今私がこの文章を書きながら片手間で食べている「ベ〇ー〇ターラー〇ン」との結びつきというのは、残念ながら「夜」という言葉と比べるとかなり低いと言わざるを得ません（例：月にベ〇ー〇ターラー〇ンを落とす）。
      </p>
      <p>
        もっと一般的な例を挙げるとするならば、ある言葉と組み合わされて使用される確率が高い言葉を示す「共起語・連語・連想語」なんかはまさにそれです。<br>
        こうした言葉が存在することからも、言葉同士の結びつきには偏りがあることが見て取れます。
      </p>
      <p>
        この偏りがあることによって、本来であれば有意味となる言葉の組み合わせがあったとしても、組み合わせられる確率が低いために選択されないどころか、その可能性に気づくこともできないという事態を引き起こします。<br>
        言語というのは本来、より表現豊かなものであるはずなのに、人間側がこうしたバイアスを無意識のうちに掛けてしまうために、その力を存分に発揮されることがほとんどありません。<br>
        あるいは、有限である言語の表現力が、人間側のバイアスによってさらに制限されてしまう、とも言えるでしょう（表現としてはこちらの方が適切）。<br>
        どちらにせよ、これはもったいないことであり、また言語に対して申し訳なくもあるのです。
      </p>
      <p>
        では、どうすればこの偏り、もとい「言語の不自由さ」を乗り越えることができるのでしょうか？<br>
      </p>
      <p>
        その答えが、<b><u>「カットアップ」</u></b>です。
      </p>
      <p>
        カットアップでは、切り取った言葉を無作為に並び替えます。<br>
        そこに人間側の言葉のバイアスが入り込む余地はなく、機械的なプロセスによって文章は生成されます。<br>
        かくして言語に対するバイアスは消滅し、より自由度の高い言葉の表現が可能になる、というわけです。
      </p>
      <p>
        が、しかし。<br>
        本当にそれですべてが解決するのでしょうか？
      </p><br>
      <h3>ウィリアム・バロウズ</h3>
      <p>
        このように考えた作家は世の中に数多く存在します。<br>
        アメリカの作家 ウィリアム・バロウズもその一人です。
      </p>
      <p>
        バロウズが私と全く同じように考えたかは定かではありませんが、バロウズの著書『裸のランチ』において、先ほどの『論理哲学論考』からの引用が存在することから、少なくともバロウズはカットアップとウィトゲンシュタインの二つに関連を見出していたと考えます。
      </p>
      <p>
        では、果たしてバロウズのその結果はどうだったのか。<br>
        その答えの一つとして、『裸のランチ』からとある会話文を引用したいと思います。
      </p>
      <p>
        ==========<br><br>
        「立てよ、ガーディ、土地の連中に敬意を示すんだ」<br>
        「そうすべきでしょうね」<br>
        「ねえきみ、ぼくは実に驚くべき発明に従事しているよ……<u>いく</u>と、とたんに消えてしまう少年なんだ、木の葉が燃えているにおいと、遠い汽車の汽笛の音を残してね」<br>
        <br>
        W・バロウズ: 裸のランチ, 河出文庫, 鮎川信夫 (訳), 2003, 13刷, p.158<br><br>
        ==========<br>
        <span style="font-size: 2rem">（会話はまだ続くのですが、少々センシティブな内容を含む＆長くなるため、ここでの引用は避けさせていただきます）</span>
      </p>
      <p>
        若干文脈として不自然な返答もあれば、明らかに会話が成り立っていない所もあるかと思います。<br>
        意図的にそうした箇所を引用したという側面もありますが、この小説は全体的にこうした脈絡のない展開を非常に多く含みます。
      </p>
      <p>
        このようにカットアップでは、作者が意図的に文章を修正していたとしても、前後の文脈が繋がらなかったり、あるいは言語としてナンセンスな文章を大量に生み出してしまうといったことが頻発します。<br>
      </p>
      <p>
        バロウズのそれはそれで、一つの作品として非常に魅力的なものであると私は感じるのですが、ただこれが一般にウケなかったことは言うまでもありません（バロウズは有名な作家ですが、その本の表現が評価されたアーティストというわけではありません）。
      </p>
      <p>
        <u>言語の自由さを追求すると、途端に一般性を失っていく。</u><br>
        では、このジレンマをどう克服すればよいのでしょうか？
      </p>
      <p>
        方法はたくさんあるかと思いますが、私は<b>「自然言語処理」</b>と<b>「ショートショート」</b>という二つの視点からその可能性を模索してみました。
      </p><br>
      <h2>2. 自然言語処理</h2>
      <p>
        自然言語処理とは、我々が日常的に使っている言語をコンピュータによって処理する技術のことです。<br>
        分かりやすいものであれば、会話AIや翻訳機能、音声認識、文章自動要約などなどなどなど……。<br>
        扱っているものが言語とコンピュータという組み合わせのため、とにかく扱う幅が広いです。
      </p>
      <p>
        このゲームで主に使われている自然言語処理の技術として、「形態素解析」と「文章生成」の二つが挙げられます。<br>
        形態素解析は文章を品詞に分解する技術（正確には違う）のことで、これをカットアップの手がかりとして利用しています。<br>
        また文章生成では、形態素解析の結果を元に、確率的に言葉同士を繋ぎ合わせる<u>N階マルコフ連鎖</u>という手法を用いて文章を生成しています（詳しい解説は省略）。
      </p>
      <p>
        他にも、<a href="https://www.12kai.com/cutup/cumaking01.html" target="_blank" rel="noopener">細馬宏通教授による「カットアッププログラム」</a>を参考にしたオリジナルのカットアッププログラムといったものも使用しています（こちらについてはいずれアプリとして公開する予定です）。<br>
      </p>
      <p>
        このように、自然言語処理の技術をカットアップに応用することによって、無秩序な文章の破壊ではなく、「多少の」文法・文脈を考慮した上での文章の切り取り、および文章生成ができるようになります。
      </p>
      <p>
        通常のカットアップと比べると表現の自由度に制限が掛かりますが、完全に文法の崩壊した文章が生成されにくいため、誤解を恐れずに言うならば、有意味とナンセンスのギリギリを攻めるような文章を作ることに長けています（もちろん、設定次第では滅茶苦茶な文章も生成できます）。
      </p><br>
      <h3>ストーリー・シナリオの構築</h3>
      <p>
        しかし、構文解析と文章生成の二つを持ってしても、まだ解決できない問題があります。<br>
        それは<u>ストーリーやシナリオ</u>です。<br>
        いくら文章を生成できたとしても、それらは元ある文章の言葉をランダムに組み替えただけですので、そこから一定の流れを持つストーリーやシナリオを構築することはほぼ不可能です。
      </p>
      <p>
        しかし、逆にこうも考えることはできないでしょうか？
      </p>
      <p>
        <b>「最初からシナリオなんていらない」</b>
      </p>
      <p>
        完全にいらない、というわけではありませんが、少なくとも大きな流れを持つ物語だけで文学の世界が成り立っているわけではありません。
      </p><br>
      <h2>3. ショートショート</h2>
      <p>
        ここで二つ目の視点、<b>「ショートショート」</b>です。
      </p>
      <p>
        ショートショートを一言で述べるとするならば、「短く、ユーモアに富んだ小説」といった感じでしょうか。<br>
        どれくらい短いのかを知るために、ここでは稲垣足穂の『一千一秒物語』の世界を覗いてみましょう。
      </p>
      <p>
        ==========<br><br>
        ある夜倉庫のかげで聞いた話<br><br>

        「お月様が出ているね」<br>
        「あいつはブリキ製です」<br>
        「なに、ブリキ製だって？」<br>
        「ええどうせ旦那、ニッケルメッキですよ」（自分が聞いたのはこれだけ）<br><br>

        稲垣足穂: 一千一秒物語, 新潮文庫, 1923, 13刷, p.12<br><br>
        ==========<br>
        <span style="font-size: 2rem;">（もちろん作品によってショートショートの長さはまちまちですが、このように短く、しかし全く予想のつかない意外な結末を持つ作品を見ると、私はショートショートらしさを感じます）</span>
      </p>
      <p>
        このようにショートショートにおいて、シナリオが必ずしも重要項目にはなりません。<br>
        短いからこそインパクトのあるユーモアが、ショートショート最大の特徴です。
      </p><br>
      <h3>カットアップ・自然言語処理・ショートショート</h3>
      <p>
        このショートショートですが、カットアップと非常に相性が良いと思いませんか？<br><br>
        片や摩訶不思議な言葉の羅列を作れるが、大きな流れを持つ文章は作れない。<br>
        片やユーモラスが重視される非常に短い物語。
      </p>
      <p>
        そう、<b>実はこの二つは相性が抜群に良いのです。</b><br>
      </p>
      <p>
        最初からストーリーやシナリオを捨て、短くユーモアに特化したショートショート形式の物語を、自然減処理を活用したカットアップで作れば、摩訶不思議な言葉の羅列と、一般性を両立した面白い作品が作れるのではないだろうか……？
      </p>
      <p>
        その試みこそが、この『めうちきりんのメトロポリス』であり、このゲームが「言葉遊び」である所以です。
      </p><br>
      <h2>4. おわりに</h2>
      <p>
        「あとがきが本編」と言わんばかりの長ったらしい文章を最後まで読んでくださり、本当にありがとうございます……汗<br>
      </p>
      <p>
        最後に宣伝という形になってしまうのですが、私は音楽制作とプログラミングで色々なものを作ることが本職です。<br>
        <a href="https://portfolio.ippee-music.com/" target="_blank" rel="noopener">ポートフォリオ</a>では過去の作品、<a href="https://ippee-music.com/" target="_blank" rel="noopener">ブログ『オルタナハアト』</a>では技術寄りの内容を公開しておりますので、ぜひこちらもご覧ください。
      </p>
      <p>
        というわけで、『めうちきりんのメトロポリス』をこれにて〆たいと思います。<br>
        最後までお付き合いいただきありがとうございました。
      </p>
      <p>
        それではみなさん、良い夢を……。
      </p>
    </perfect-scrollbar>
  </div>
</template>

<script>
export default {
  name: 'afterword',
  mounted: function() {
    document.getElementById('afterword').classList.add('fadein')
  },
}
</script>

<style>
.afterword .ps {
  width: 60vw;
  height: 60vh;
}

.afterword * {
  user-select: text!important;
  -webkit-user-select: text !important;
  -ms-user-select: initial !important;
  cursor: auto !important;
  pointer-events: all !important;
}

.afterword p {
  text-align: left;
  font-size: 2.4rem;
  margin: 3rem 3rem;
}

.afterword a {
  font-size: 2.4rem;
  border-bottom: 1px dashed #fbfaf5;
}

.afterword h3 {
  font-size: 2.4rem;
  padding-top: 1rem;
}
</style>