export default [
  {
    "index": "0",
    "title": "THE SAVAGE MOON CAT",
    "content": [
      "登ってしまったお月様が　街路の中へ投げこまれた",
      "そのまんなかでまるい孔を開けると　黒猫の影が飛び出した",
      "そして暗い小路の猫が　鳥の腕を三つ取った"
    ]
  },
  {
    "index": "1",
    "title": "プラタナスの鍵",
    "content" : [
      "A氏は夜更けのほうへ　流星をうたいながら歩いている",
      "月もプラタナスの鍵の方へ　ゆっくり動き始めた",
      "こうしてお月様は　第二の月の方へ自分を残してしまった"
    ]
  },
  {
    "index": "2",
    "title": "盲目",
    "content" : [
      "一時半になっている夜",
      "たれもいなかったので　塀の上でタバコを捨てあけると",
      "ポケットのないホーキ星が　眼をころがしていた",
      "おれはそれからからっぽで",
      "自分の中が見えなくなった"
    ]
  },
  {
    "index": "3",
    "title": "不意打ち",
    "content" : [
      "ピストルのかみ合う音がしていた",
      "Aという人がその弾をこめた",
      "その路上で火を吸おうと　カウンターの引き出しを残して立ち上がったが",
      "すぐ先の帽子屋へ突きとばされた",
      "気がつくと　お月様はこなごなになっていた"
    ]
  },
  {
    "index": "4",
    "title": "とばっちり",
    "content" : [
      "赤い月とナンセンスな太陽が　ドン！　と衝突した",
      "そのはずみに　赤い月は捨てセリフを落とした",
      "捨てセリフは　ぬれたアスファルトの上に落ち",
      "地球がロマンチツクの彼方へ　かち飛ばされた"
    ]
  },
  {
    "index": "5",
    "title": "星の生態",
    "content" : [
      "青い月の説によると",
      "星は論理において　いつも同じ位置に散乱するが",
      "千一時間に一度",
      "いい空気を吸おうと　パタパタと飛んで行って",
      "天空を留守にしてしまうのだ"
    ]
  },
  {
    "index": "6",
    "title": "ニッケルレディ",
    "content" : [
      "街上に白い靄がうろついていた晩",
      "A氏は　ニッケルレディを組み立てた",
      "「おまえはブリキ製だ――」",
      "と云うと",
      "「自分の中はよくわからないのです」",
      "とレディは答えた",
      "レディは　片手に火を取り出し",
      "自分に投げつけた"
    ]
  },
  {
    "index": "7",
    "title": "花火",
    "content" : [
      "ある晩",
      "シグナルの街かどから　唄を投げつけた",
      "空から一メートル離れた所で　流星と衝突し",
      "三百六連発の花火が　街上で光った"
    ]
  },
  {
    "index": "8",
    "title": "唄盗み",
    "content" : [
      "金曜日の晩",
      "街かどで　唄を見失っていると",
      "暗い小路に　薄荷水のとける音が光っていた",
      "自分は　このぼんやりとした白い音をひき抜いて",
      "二階の地平線から　口笛をふいた"
    ]
  },
  {
    "index": "9",
    "title": "真黒な空のつくり方",
    "content" : [
      "一　発電所に火をつける",
      "二　ブランディびんに太陽と月を投げこむ",
      "三　星座を射ち落とす"
    ]
  },
]
