export default [
  {
    "index": "0",
    "id": "moon-cat",
    "title": "THE SAVAGE MOON CAT",
    "content": [
      "登ってしまったお月様が　街路の中へ投げこまれた",
      "そのまんなかでまるい孔を開けると黒猫の影が飛び出した",
      "そして暗い小路の猫が　鳥の腕を三つ取った"
    ]
  },
  {
    "index": "1",
    "id": "invisible",
    "title": "自分の中はよくわからない",
    "content" : [
      "「そうです　なにもかも入っている」",
      "「なに　空っぽじゃありませんか」"
    ]
  },
  {
    "index": "2",
    "id": "eyewall",
    "title": "THE EYEWALL",
    "content" : [
      "ある夜おそく",
      "公園の三階で電車をつかまえてみると",
      "自分がいなくなって恐ろしい速さで　東の赤い目が廻っていた"
    ]
  },
  {
    "index": "3",
    "id": "mauvais",
    "title": "不都合",
    "content" : [
      "黒猫をこしらえて　いやおうなしに暗い二階へ落とした",
      "ただそれだけ"
    ]
  },
  {
    "index": "4",
    "id": "evil",
    "title": "魔",
    "content" : [
      "唄を見失っていると",
      "街かどを恐ろしい速さで行くこうもりが",
      "その突きあたりに流れていった",
      "ふと壁のまえに眼のようなものがとび出して",
      "逃げて行くのが見えた"
    ]
  },
  {
    "index": "5",
    "id": "platanus",
    "title": "プラタナスの鍵",
    "content" : [
      "A氏は夜更けのほうへ流星をうたいながら歩いて　登っている",
      "月もプラタナスの鍵の方へ　ゆっくり動き始めた",
      "こうしてお月様は　第二の月の方へ自分を残してしまった"
    ]
  },
  {
    "index": "6",
    "id": "blindness",
    "title": "盲目",
    "content" : [
      "一時半になっている夜",
      "たれもいなかったので　塀の上でタバコを捨てあけると",
      "ポケットのないホーキ星が眼をころがしていた",
      "おれはそれからからっぽで",
      "自分の中が見えなくなった"
    ]
  },
  {
    "index": "7",
    "id": "floating",
    "title": "浮遊",
    "content" : [
      "自分を見失って　自分を歩きながら考えた",
      "ハッと思うと",
      "そこで自分がひっくり返った",
      "するとパタパタと飛んでいる人があった",
      "ガス燈の上を通って",
      "よく見ようとするうちにかどを曲がってしまった"
    ]
  },
  {
    "index": "8",
    "id": "defeat",
    "title": "戦敗",
    "content" : [
      "ピストルのかみ合う音がしていた",
      "Aという人がその粉をこめた",
      "その路上で火を吸おうと　カウンターの引き出しを残して立ち上がったが",
      "すぐ先の帽子屋へ突きとばされた",
      "気がつくと　お月様はこなごなになっていた"
    ]
  },
  {
    "index": "9",
    "id": "star",
    "title": "WHY DID THE STAR RUN AWAY FROM THERE?",
    "content" : [
      "流星は石を落とした",
      "その石が　アスファルトの上に落ちた",
      "が　月の上に逃げた"
    ]
  },
]

