export default [
  {
    "index": "0",
    "title": "遠足",
    "content" : [
      "天の川の中をぢつと凝視すると",
      "まっさかさまに輝く星々の航海が見えた",
      "むこうには　幸福な遊び場があるかしれないと思い",
      "私は星になって　ピュン！　飛び出した"
    ]
  },
  {
    "index": "1",
    "title": "唄を盗む人",
    "content" : [
      "街かどで　唄を見失っていると",
      "暗い小路に　薄荷水のとける音が光っていた",
      "自分は　このぼんやりとした白い音をひき抜いて",
      "二階の地平線から　口笛をふいた"
    ]
  },
  {
    "index": "2",
    "title": "THE ECLIPSE",
    "content" : [
      "赤い月とナンセンスな太陽が　ドン！　と衝突した",
      "そのはずみに　月は捨てセリフを落とした",
      "捨てセリフは　ぬれたアスファルトの上に落ち",
      "地球が　ロマンチツクの彼方へ　かち飛ばされた"
    ]
  },
  {
    "index": "3",
    "title": "QUESTION: WHERE AM I NOW?",
    "content" : [
      "A氏は夜更けのほうへ　流星をうたいながら歩いている",
      "月もプラタナスの鍵の方へ　ゆっくり動き始めた",
      "こうしてお月様は　第二の月の方へ自分を残してしまった"
    ]
  },
  {
    "index": "4",
    "title": "星の生態",
    "content" : [
      "青い月の説によると",
      "星は理論において　いつも同じ位置に散乱するが",
      "千一時間に一度",
      "いい空気を吸おうと　パタパタと飛んで行って",
      "天空を留守にしてしまうのだ"
    ]
  },
  {
    "index": "5",
    "title": "迎撃",
    "content" : [
      "ある晩",
      "シグナルの街かどから　唄を投げつけた",
      "唄は空から一メートル離れた所で　流星と衝突し",
      "三百六連発の花火が　街上で光った"
    ]
  },
  {
    "index": "6",
    "title": "THE SAVAGE MOON CAT",
    "content": [
      "登ってしまったお月様が　街路の中へ投げこまれた",
      "そのまんなかでまるい孔を開けると　黒猫の影が飛び出した",
      "そして　猫は暗い小路で",
      "鳥の腕を三つ取った"
    ]
  },
]
